# AnalysisDisplayColorSettings Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisDisplayColorSettings Members
AnalysisDisplayColorSettings Class Constructors Methods Properties See Also
---
The AnalysisDisplayColorSettings type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AnalysisDisplayColorSettings()()()() | Constructs a default instance of color settings. |
| AnalysisDisplayColorSettings(AnalysisDisplayColorSettings) | Constructs a new copy of the input AnalysisDisplayColorSettings object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AreIntermediateColorsValid | Verify intermediate color entries |
| Colors | Get number of colors, including min, max and intermediate. |
| Dispose | Releases all resources used by the AnalysisDisplayColorSettings |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetIntermediateColors | Get intermediate color entries (other than the minimum and maximum settings). |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Compares two color settings objects. |
| SetIntermediateColors | Set intermediate color entries (other than the minimum and maximum settings). |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ColorSettingsType | Stores type of color settings |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MaxColor | Color assigned to the maximum value. |
| MinColor | Color assigned to the minimum value. |

# See Also
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace